{
  "movies": [
    {
      "id": 1,
      "posterUrl": "https://image.tmdb.org/t/p/original//fLOB1MdIf2jWexxOzq441lNTIpW.jpg",
      "title": "Juice",
      "rating": 5,
      "movieSummary": "Four Harlem friends Bishop, Q, Steel and Raheem  dabble in petty crime, but they decide to go big by knocking off a convenience store. Bishop, the magnetic leader of the group, has the gun. But Q has different aspirations. He wants to be a DJ and happens to have a gig the night of the robbery. Unfortunately for him, Bishop isn't willing to take no for answer in a game where everything's for keeps."
    },
    {
      "id": 2,
      "title": "Life",
      "movieSummary": "Two men in 1930s Mississippi become friends after being sentenced to life in prison together for a crime they did not commit.",
      "posterUrl": "https://image.tmdb.org/t/p/original/saWYpX3ADdmdByQZVrSYUNbQ9GC.jpg",
      "rating": 5
    },
    {
      "id": 3,
      "title": "Training Day",
      "movieSummary": "On his first day on the job as a narcotics officer, a rookie cop works with a rogue detective who isn't what he appears.",
      "posterUrl": "https://image.tmdb.org/t/p/original/bUeiwBQdupBLQthMCHKV7zv56uv.jpg",
      "rating": 4
    },
    {
      "id": 4,
      "posterUrl": "https://image.tmdb.org/t/p/original/oG1heUs503GV6xBnFhgyYTGWm05.jpg",
      "title": "The Lion King ",
      "rating": "1",
      "movieSummary": "This Disney animated feature follows the adventures of the young lion Simba the heir of his father, Mufasa. Simba's wicked uncle, Scar, plots to usurp Mufasa's throne by luring father and son into a stampede of wildebeests. But Simba escapes, and only Mufasa is killed. Simba returns as an adult to take back his homeland from Scar with the help of his friends Timon and Pumbaa."
    },
    {
      "id": 5,
      "posterUrl": "https://image.tmdb.org/t/p/original//v4ox4aSCNT5vyLXl4Q71JiWwCXW.jpg",
      "title": "Boyz n The Hood",
      "rating": "2",
      "movieSummary": "Tre is sent to live with his father, Furious Styles, in tough South Central Los Angeles. Although his hard-nosed father instills proper values and respect in him, and his devout girlfriend Brandi teaches him about faith, Tre's friends Doughboy and Ricky don't have the same kind of support and are drawn into the neighborhood's booming drug and gang culture, with increasingly tragic results."
    },
    {
      "id": 6,
      "title": "Sing",
      "movieSummary": "Coming in on the tail end of a rhythm and blues singing group explosion, The Five Heartbeats rise and fall within the space of seven years. Along the way, the group deals with all manner of fame and fortune distractions jealousy, greed, too much womanizing and drugs all take a toll. Their troubles culminate when executive Big Red is arrested for the murder of manager Jimmy Potter.",
      "posterUrl": "https://image.tmdb.org/t/p/original//h151oRzvsxfKRznEmlQJRlnvsid.jpg",
      "rating": 2
    },
    {
      "id": 7,
      "posterUrl": "https://image.tmdb.org/t/p/original//oZRVDpNtmHk8M1VYy1aeOWUXgbC.jpg",
      "title": "Terminator Genisys ",
      "rating": "4",
      "movieSummary": "The year is 2029. John Connor, leader of the resistance continues the war against the machines. At the Los Angeles offensive, John's fears of the unknown future begin to emerge when TECOM spies reveal a new plot by SkyNet that will attack him from both fronts; past and future, and will ultimately change warfare forever."
    },
    {
      "id": 8,
      "title": "Rocky",
      "movieSummary": "An uneducated collector for a Philadelphia loan shark is given a once-in-a-lifetime opportunity to fight against the world heavyweight boxing champion.",
      "posterUrl": "https://image.tmdb.org/t/p/original//fKe9y1AJHEzoiHwSrjfwyinuCE8.jpg",
      "rating": 4
    },
    {
      "id": 9,
      "title": "King Kong",
      "movieSummary": "In 1933 New York, an overly ambitious movie producer coerces his cast and hired ship crew to travel to mysterious Skull Island, where they encounter Kong, a giant ape who is immediately smitten with the leading lady.",
      "posterUrl": "https://image.tmdb.org/t/p/original//6a2HY6UmD7XiDD3NokgaBAXEsD2.jpg",
      "rating": 3
    },
    {
      "id": 10,
      "posterUrl": "https://image.tmdb.org/t/p/original//arw2vcBveWOVZr6pxd9XTd1TdQa.jpg",
      "title": "Forrest Gump",
      "rating": "2",
      "movieSummary": "A man with a low IQ has accomplished great things in his life and been present during significant historic events—in each case, far exceeding what anyone imagined he could do. But despite all he has achieved, his one true love eludes him."
    },
    {
      "id": 11,
      "posterUrl": "https://image.tmdb.org/t/p/original//ttryglcY2osWZE3sRYBf3ewTZsW.jpg",
      "title": "Mortal Kombat: Annihilation (1997)",
      "rating": "2",
      "movieSummary": "A group of heroic warriors has only six days to save the planet in Mortal Kombat Annihilation. To succeed they must survive the most spectacular series of challenges any human, or god, has ever encountered as they battle an evil warlord bent on taking control of Earth."
    },
    {
      "id": 12,
      "title": "The Jungle Book (2016)",
      "movieSummary": "A man-cub named Mowgli fostered by wolves. After a threat from the tiger Shere Khan, Mowgli is forced to flee the jungle, by which he embarks on a journey of self discovery with the help of the panther, Bagheera and the free-spirited bear, Baloo.",
      "posterUrl": "https://image.tmdb.org/t/p/original//xIGhgcLtzzTON56G905I5tuwNQM.jpg",
      "rating": 3
    },
    {
      "id": 13,
      "title": "The Good, the Bad and the Ugly",
      "movieSummary": "While the Civil War rages on between the Union and the Confederacy, three men – a quiet loner, a ruthless hitman, and a Mexican bandit – comb the American Southwest in search of a strongbox containing $200,000 in stolen gold.",
      "posterUrl": "https://www.themoviedb.org/t/p/w1280/bX2xnavhMYjWDoZp1VM6VnU1xwe.jpg",
      "rating": 4
    },
    {
      "id": 14,
      "title": "Shutter Island",
      "movieSummary": "World War II soldier-turned-U.S. Marshal Teddy Daniels investigates the disappearance of a patient from a hospital for the criminally insane, but his efforts are compromised by troubling visions and a mysterious doctor.",
      "posterUrl": "https://www.themoviedb.org/t/p/w1280/4GDy0PHYX3VRXUtwK5ysFbg3kEx.jpg",
      "rating": 2
    },
    {
      "title": " Interstellar",
      "movieSummary": "The adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.",
      "posterUrl": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/gEU2QniE6E77NI6lCU6MxlNBvIx.jpg",
      "rating": 3,
      "id": 15
    },
    {
      "title": "q",
      "movieSummary": "q",
      "posterUrl": "q",
      "rating": 0,
      "id": 16
    }
  ]
}